app/views/shopping_cart/checkout.html.erb

SELECT "provinces".* FROM "provinces"
---
	<%= form.label :province %></br>
	<%= select_tag "province", options_for_select(@provinces.collect{|province| [province.name,province.id]}) %></br>