app/controllers/consoles_controller.rb

DELETE FROM "consoles" WHERE "consoles"."id" = ?  [["id", 1]]
---
	def destroy
		@console.destroy

INSERT INTO "consoles" ("name", "price", "description", "date_released", "created_at", "updated_at", "image", "product_type_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
	def create
		@console = Console.create(permitted_parameters)

SELECT  "consoles".* FROM "consoles" WHERE "consoles"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
		def find_console
			@console = Console.find(params[:console_id] || params[:id])