app/controllers/customers_controller.rb

INSERT INTO "orders" ("status", "user_id", "created_at", "updated_at", "amount") VALUES (?, ?, ?, ?, ?)  [["status", "new"], ["user_id", 1], ["created_at", "2017-11-28 22:13:32.847887"], ["updated_at", "2017-11-28 22:13:32.847887"], ["amount", 94.3389]]
INSERT INTO "customers" ("first_name", "address", "postal_code", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["first_name", "gfdgf"], ["address", "dgdfg"], ["postal_code", "gffd"], ["email", "gfdgfd"], ["created_at", "2017-11-28 02:34:29.952961"], ["updated_at", "2017-11-28 02:34:29.952961"]]
INSERT INTO "line_items" ("product_name", "price", "quantity", "created_at", "updated_at", "order_id") VALUES (?, ?, ?, ?, ?, ?)  [["product_name", "Nintendo 64"], ["price", 84.99], ["quantity", 1], ["created_at", "2017-11-29 01:15:49.626395"], ["updated_at", "2017-11-29 01:15:49.626395"], ["order_id", 14]]
---
	def create
		@amount = (session[:summary]["grand_total"].to_f).round(2) * 100
		@order = Order.create(status: "new", amount: session[:summary]["grand_total"], user_id: current_user.id)
		if(@order.valid?)
			Stripe::Charge.create(customer: @customer.stripe_customer, amount: @amount.to_i, description: "product charge", currency: "usd")
			@shopping_cart.each do |line_item|
				LineItem.create(product_name: line_item["name"],price: line_item["price"],quantity: line_item["quantity"],order_id: @order.id)

SELECT  "customers".* FROM "customers" WHERE "customers"."user_id" = ? ORDER BY "customers"."id" ASC LIMIT ?  [["user_id", 3], ["LIMIT", 1]]
---
		def find_customer
			@customer = Customer.where(user_id: current_user.id).first