app/controllers/games_controller.rb

	def index
		setup
		@games = Game.all.page(params[:page]).per(8).order(:name)
---
SELECT  "games".* FROM "games" ORDER BY "games"."name" ASC LIMIT ? OFFSET ?  [["LIMIT", 8], ["OFFSET", 0]]