app/controllers/games_controller.rb

	def new
		@consoles = Console.all
		@genres = Genre.all
---
SELECT "consoles".* FROM "consoles"
SELECT "genres".* FROM "genres"