app/controllers/games_controller.rb

	def index
		@games = Game.all.page(params[:page]).per(5).order(:name)
		if(!params[:search].nil?)
			@games = !params[:console].empty? ? Game.where("name LIKE ?", "%#{params[:search]}%").where(console_id: params[:console]).order(:name).page(params[:page]).per(5) : Game.where("name LIKE ?", "%#{params[:search]}%").order(:name).page(params[:page]).per(5)
			#rails is being super effey about the or statement in activerecord needed this to filter on the genre
			if !params[:genre].empty?
				@games = @games.where(genre_id: params[:genre]).page(params[:page]).per(5);
---
SELECT  "games".* FROM "games" WHERE (name LIKE '%Super%') AND (console_id = '3' | genre_id = '') ORDER BY "games"."name" ASC LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "games" WHERE (name LIKE '%Super%') AND (console_id = '3' | genre_id = '')
SELECT  "games".* FROM "games" WHERE (name LIKE '%%') AND "games"."console_id" = ? ORDER BY "games"."name" ASC LIMIT ? OFFSET ?  [["console_id", 2], ["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "games" WHERE (name LIKE '%%') AND "games"."console_id" = ?  [["console_id", 2]]
SELECT "genres".* FROM "genres"
SELECT  "games".* FROM "games" WHERE (name LIKE '%S%') AND "games"."console_id" = ? AND "games"."genre_id" = ? ORDER BY "games"."name" ASC LIMIT ? OFFSET ?  [["console_id", 4], ["genre_id", 5], ["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "games" WHERE (name LIKE '%S%') AND "games"."console_id" = ? AND "games"."genre_id" = ?  [["console_id", 4], ["genre_id", 5]]

	def update
		if(@game.update(permitted_parameters))
---
UPDATE "games" SET "console_id" = ?, "updated_at" = ? WHERE "games"."id" = ?  [["console_id", 4], ["updated_at", "2017-11-23 14:04:55.061344"], ["id", 1]]

	def create
		@game = Game.create(permitted_parameters)
---
INSERT INTO "games" ("console_id", "genre_id", "product_type_id", "name", "price", "description", "date_released", "created_at", "updated_at", "image") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

		def find_game
			@game = Game.find(params[:game_id] || params[:id])
---
SELECT  "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]