app/controllers/genres_controller.rb

UPDATE "genres" SET "name" = ?, "updated_at" = ? WHERE "genres"."id" = ?  [["name", "Platformers"], ["updated_at", "2017-11-22 19:25:37.596377"], ["id", 1]]
---
	def update
		if(@genre.update(permitted_parameters))

INSERT INTO "genres" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Platformer"], ["created_at", "2017-11-22 19:25:30.540839"], ["updated_at", "2017-11-22 19:25:30.540839"]]
---
	def create
		@genre = Genre.create(permitted_parameters)

SELECT  "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
		def find_genre
			@genre = Genre.find(params[:id])