app/controllers/home_controller.rb

SELECT "games".* FROM "games" WHERE ("games"."created_at" BETWEEN ? AND ?)  [["created_at", "2017-11-20 14:08:16.757667"], ["created_at", "2017-11-23 14:08:16.757765"]]
---
	def index
		@all_products = Game.all + Console.all