app/controllers/orders_controller.rb

SELECT  "orders".* FROM "orders" WHERE "orders"."user_id" = ? ORDER BY "orders"."id" ASC LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
---
	def index
		@orders = Order.where(user_id: current_user.id)

SELECT "line_items".* FROM "line_items" WHERE "line_items"."order_id" = ?  [["order_id", 2]]
---
	def show
		@line_items = LineItem.where(order_id: params[:id])