app/controllers/registrations_controller.rb

		def load_provinces
			@provinces = Province.all
---
SELECT "provinces".* FROM "provinces"