app/controllers/shopping_cart_controller.rb

	def checkout
		@provinces = Province.all
---
SELECT "provinces".* FROM "provinces"