app/views/common/_search.html.erb

	<% if(category) %>
		<%= select_tag 'console', options_for_select(@consoles.collect {|console| [console.name,console.id]}), :include_blank => true %>
		<%= label_tag 'Genres', 'Genres:'%>
		<%= select_tag 'genre', options_for_select(@genres.collect {|genre| [genre.name,genre.id]}), :include_blank => true %>
---
SELECT "consoles".* FROM "consoles"
SELECT "genres".* FROM "genres"